## Introduction to DataFrame

In [ ]:
import numpy as np
import pandas as pd

In [2]:
df = pd.read_csv("weather_data.csv")
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [28]:
weather_data = [('1/1/25',38,6,'Rain'),
                ('2/4/25',32,6,'sunny'),
                ('1/6/25',38,6,'Rain'),
                ('1/7/25',32,9,'summer'),
                ('1/9/25',39,6,'Rain'),
                ('1/12/25',32,2,'winter'),
                ]

df =  pd.DataFrame(weather_data,columns=['Days','Temperature','windspeed','event'])
df

      Days  Temperature  windspeed   event
0   1/1/25           38          6    Rain
1   2/4/25           32          6   sunny
2   1/6/25           38          6    Rain
3   1/7/25           32          9  summer
4   1/9/25           39          6    Rain
5  1/12/25           32          2  winter

In [5]:
df.shape

(6, 4)

In [6]:
df.head

<bound method NDFrame.head of       Days  Temperature  windspeed   event
0   1/1/25           32          6    Rain
1   2/4/25           32          6   sunny
2   1/6/25           32          6    Rain
3   1/7/25           32          6  summer
4   1/9/25           32          6    Rain
5  1/12/25           32          6  winter>

In [7]:
df.event

0      Rain
1     sunny
2      Rain
3    summer
4      Rain
5    winter
Name: event, dtype: object

In [9]:
df.tail

<bound method NDFrame.tail of       Days  Temperature  windspeed   event
0   1/1/25           32          6    Rain
1   2/4/25           32          6   sunny
2   1/6/25           32          6    Rain
3   1/7/25           32          6  summer
4   1/9/25           32          6    Rain
5  1/12/25           32          6  winter>

In [10]:
df.columns

Index(['Days', 'Temperature', 'windspeed', 'event'], dtype='object')

In [11]:
df.Days

0     1/1/25
1     2/4/25
2     1/6/25
3     1/7/25
4     1/9/25
5    1/12/25
Name: Days, dtype: object

In [12]:
df[3:]

      Days  Temperature  windspeed   event
3   1/7/25           32          6  summer
4   1/9/25           32          6    Rain
5  1/12/25           32          6  winter

In [17]:
df[['Days','event']]

      Days   event
0   1/1/25    Rain
1   2/4/25   sunny
2   1/6/25    Rain
3   1/7/25  summer
4   1/9/25    Rain
5  1/12/25  winter

In [20]:
df[['Temperature','windspeed']]

   Temperature  windspeed
0           32          6
1           32          6
2           32          6
3           32          6
4           32          6
5           32          6

In [21]:
df['Temperature'].max()

np.int64(32)

In [22]:
df['Temperature'].min()

np.int64(32)

In [23]:
df['Temperature'].mean()

np.float64(32.0)

In [24]:
df['Temperature'].describe()

count     6.0
mean     32.0
std       0.0
min      32.0
25%      32.0
50%      32.0
75%      32.0
max      32.0
Name: Temperature, dtype: float64

In [29]:
df[df.Temperature == df.Temperature.max()]

     Days  Temperature  windspeed event
4  1/9/25           39          6  Rain

In [30]:
df.Days[df.Temperature == df.Temperature.max()]

4    1/9/25
Name: Days, dtype: object

# Operations on Pandas

In [ ]:
# pip3 install xlrd

%pip install xlrd
%pip install openpyxl

Requirement already satisfied: xlrd in c:\users\harsh\appdata\local\programs\python\python312\lib\site-packages (2.0.2)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

Requirement already satisfied: openpyxl in c:\users\harsh\appdata\local\programs\python\python312\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\harsh\appdata\local\programs\python\python312\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

[notice] A new release of pip is available: 24.2 -> 25.3
[notice] To update, run: python.exe -m pip install --upgrade pip

In [1]:
import pandas as pd
df= pd.read_excel('weather_data.xlsx')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [ ]:
#write DF to csv

df.to_csv('new.csv')   #By default, Pandas includes the index column (0,1,2,3â€¦)
df.to_csv('new_noIndex.csv', index=False)     # in this index removed

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [4]:
#write DF to Excel

df.to_excel('new.xlsx', sheet_name='weather_data')

## GROUP-BY

In [8]:
import pandas as pd
df = pd.read_csv('weather_data_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

In [26]:
g = df.groupby('city')   # pandas object bnanata h
g

In [ ]:
for city, city_df in g:
    print(city)
    print(city_df)

mumbai
        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
new york
        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
paris
         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [25]:
#or to get specific group
g.get_group('new york')

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [23]:
print(g.max())#Find maximum temperature in each of the cities
print(g.max())

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny
               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [27]:
print(g.mean())

TypeError: agg function failed [how->mean,dtype->object]

In [28]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

### Concatenate Data Frames

In [2]:
import pandas as pd
indian_weather = pd.DataFrame({
    "city": ["mumbai","delhi","banglore"],
    "temperature": [32,45,30],
    "humidity": [80, 60, 78]
})
indian_weather

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78

In [3]:
us_weather = pd.DataFrame({
    "city": ["new york","chicago","orlando"],
    "temperature": [21,14,35],
    "humidity": [68, 65, 75]
})
us_weather

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [8]:
#concate two dataframes
df = pd.concat([indian_weather, us_weather])
df#concate two dataframes
df = pd.concat([indian_weather, us_weather])
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [ ]:
#if you want continuous index
df = pd.concat([indian_weather, us_weather], ignore_index=True)
df

       city  temperature  humidity
0    mumbai           32        80
1     delhi           45        60
2  banglore           30        78
3  new york           21        68
4   chicago           14        65
5   orlando           35        75

In [10]:
df = pd.concat([indian_weather, us_weather],axis=1)
df

       city  temperature  humidity      city  temperature  humidity
0    mumbai           32        80  new york           21        68
1     delhi           45        60   chicago           14        65
2  banglore           30        78   orlando           35        75

## Merge DataFrames

In [ ]:
temperature_df = pd.DataFrame({
    "city": ["mumbai","delhi","banglore","hyderabad"],
    "temperature": [32,43,36,40]})
temperature_df

        city  temperature
0     mumbai           32
1      delhi           43
2   banglore           36
3  hyderabad           40

In [20]:
humidity_df = pd.DataFrame({
    "city": ["delhi","mumbai","banglore"],
    "humidity": [68, 65, 75]})
humidity_df

       city  humidity
0     delhi        68
1    mumbai        65
2  banglore        75

In [21]:
#merge two dataframes with out explicity mention index
df = pd.merge(temperature_df, humidity_df, on ='city')
df

       city  temperature  humidity
0    mumbai           32        65
1     delhi           43        68
2  banglore           36        75

In [22]:
df = pd.merge(temperature_df, humidity_df, on ='city', how='outer')
df

        city  temperature  humidity
0   banglore           36      75.0
1      delhi           43      68.0
2  hyderabad           40       NaN
3     mumbai           32      65.0

## Numerical Indexing (.loc vs iloc)

In [23]:
df = pd.DataFrame([1,2,3,4,5,6,7,8,9,19], index=[49,48,47,46,45, 1, 2, 3, 4, 5])
df

     0
49   1
48   2
47   3
46   4
45   5
1    6
2    7
3    8
4    9
5   19

In [ ]:
df.loc[:2] #label-based selection

    0
49  1
48  2
47  3
46  4
45  5
1   6
2   7

In [ ]:
df.iloc[:2] #integer-position based selection

    0
49  1
48  2

In [29]:
df.loc[45]

0    5
Name: 45, dtype: int64

In [33]:
df.iloc[45]

IndexError: single positional indexer is out-of-bounds